/**
 * @author Zafarzhon_Odilov
 * @link https://github.com/zafarzhon
 */

/**
 * Задача 1:
 * Создать программу, которая будет выводить в консоли Ваше имя и фамилию.
 * Задача 2:
 * Добавить в программу целочисленную переменную с названием age, в которой будет
 * храниться ваш возраст. Вывести в консоли ваше имя, фамилию и возраст
 */
public class FirstBlock {
    public static void main(String[] args) {
        int myAge = 22;
        String myName = "Zafarzhon";
        String mySurname = "Odilov";
        System.out.println(myName + " " + mySurname + ", " + myAge + " years.");
    }


}
