/**
 * @author Zafarzhon_Odilov
 * @link https://github.com/zafarzhon
 */

/**
 * Зарегистрировать аккаунт на GitHub-е
 * Создать новый репозитория для хранения домашних работ (через idea)
 * Добавить аккаунт gr00shik для доступа к репозиторию
 * Создать ветку для лекции 2 с новым модулем (один Java класс с любым функционалом) и залить ее на GitHub
 * Создать Pull Request из новый ветки в master
 */
public class Main {
    public static void main(String[] args) {
        System.out.println("PULL REQUEST");
    }
}
